# PipeFittingAndAccessoryConnectorData Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PipeFittingAndAccessoryConnectorData Class
Members See Also
---
The input data used by external servers for calculation of the pipe fitting and pipe accessory coefficient.
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class PipeFittingAndAccessoryConnectorData : IDisposable
```

Visual Basic
---
```text
Public Class PipeFittingAndAccessoryConnectorData _
	Implements IDisposable
```

Visual C++
---
```text
public ref class PipeFittingAndAccessoryConnectorData : IDisposable
```

# Remarks
width, height, diameter, flow, velocity pressure and connector index are input data for the calculation,
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Plumbing..::..PipeFittingAndAccessoryConnectorData
# See Also
PipeFittingAndAccessoryConnectorData Members
Autodesk.Revit.DB.Plumbing Namespace